[{"title":"100 nou","stats":["24 pp","4x5\"","1 color ","risograph ","saddle stitched","printed by Perfectly Acceptable in Chicago"],"quotes":["\"Faces laid more bare in their sorrowful eyes, than their naked bodies...\"--Shawn Starr"],"descriptions":["Fragmentary and fleeting, an avatar stands in an empty space--naked in front of cloud cover. ","Nou is puzzling in a way that is different from experimental writers like Georges Perec. Her puzzles are orchestrated not so much by formal rules, but by the complexities of life today. Much of her past work consists of love letters, screen-caps, stickers, zines, and graffiti--which through her oeuvre--collide with panache. Nou lives in Portland."]},{"title":"2001 Blaise Larmee","stats":["176p","7x10\""]},{"title":"270º Maggie Umber","stats":["136 pp","6x6\"","CMYK offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"Umber captures the spirit of nature--its glory and grace--in her beautifully crafted, mixed media comics.\"--Alyssa Berg, author of Alpenglow","\"Maggie Umber's 270° is beautiful to experience and the narrative engrossing. I was pulled in to the reality of the Owls. A fascinating read, gorgeously depicted.\"--Mike Dawson, author of Why Did They Come? \r\n\"When 270º, Maggie Umber's second beautifully illustrated book on owls reached me I could not put it down until I had absorbed all its delightful owl and other artwork from cover to cover. This book will turn heads and make the viewers turn pages. The playful layout and creative and diverse artwork seduces the reader into absorbing the subtle but factual information woven throughout these pages. The words sometimes blend into the images, like grass, twigs and branches of the owls' habitats. Maggie has created a book of owls that reminds even the most objective owl scientists like me that there are other aesthetically pleasing ways to know owls.\"--Dr. James Duncan, Balmoral, Manitoba, Canada"],"descriptions":["Informative, colorful mixed-media work that bridges nature science and fine art--quintessential comics with an ornithological bend.","An artist's field guide on owls and owl behavior. Maggie Umber once again takes readers into nature, showing the beauty and sophistication of animals in their natural habitats. 270º is an educational glimpse of owls found in North America and beyond.","Maggie Umber is a cartoonist, painter, printmaker, and programmer. She has published three graphic novels with 2dcloud: Time Capsule, Sound of Snow Falling, 270º. Her comics have appeared in BOMB magazine, NOW, Warmer, The Shirley Jackson Project. Maggie's work has also been included in group shows like ZINE NOT DEAD VIIII: A New Comics Reading (WE ARE HUNGRY!), zeitraumexit in Germany (\"...and other stories\") and The Learning Machine in Chicago (Plants and Animals). She is one of the co-founders at 2dcloud."]},{"title":"Altcomics Magazine #1","stats":["16 pp","7.5x10\"","1, 2 color risograph","corner stitched","printed by Perfectly Acceptable in Chicago"],"descriptions":["This first collector's issue features Aidan Koch drawing in Central Park, Sab in the Upper West Side, Lala Albert & Leah Wishnia in Lala's Bushwick bedroom studio, and Nou, the cover artist. Ed. Blaise Larmee"]},{"title":"Altcomics Magazine #2","stats":["16 pp","7.5x10\"","1, 2 color risograph","corner stitched","printed by Perfectly Acceptable in Chicago"],"descriptions":["This second issues features interviews with cover artist Margot Ferrick (Chicago), Frank Santoro (Pittsburgh), Austin English (New York), & Dylan Williams. Ed. Blaise Larmee"]},{"title":"Altcomics Magazine #3","stats":["16 pp","7.5x10\"","1, 2 color risograph","corner stitched","printed by La Mano 21 in Minneapolis"],"descriptions":["Cover by GG, ed. Sab Meynert, Production Design: Jake Terrell, Contributors:, GG, Juli Majer, Eli Howey"]},{"title":"Altcomics Magazine #4","stats":["16 pp","8.5x11\"","CMYK offset","corner stitched","printed by Marquis in Montreal"],"descriptions":["Cover by Maggie Umber. Altcomics goes to Canada to get color offset printed. Maggie Umber, Juliacks, Christopher L. G. Hill, Stephen Hayes, Wiley Guillot, and Tracy Auch answer our questions and give us text unasked for. Kim Jooha and Blaise Larmee interview. Ed. Blaise Larmee"]},{"title":"Altcomics Magazine #5","stats":["24 pp","8.5x11\"","CMYK offset","corner stitched","printed by Marquis in Montreal"],"descriptions":["Interviews with Paul Peng, Ashlee H.G., and Almon @roman_bulge. Altcomics expands to 24 pages. Ed. Blaise Larmee. Cover by Paul Peng."]},{"title":"Altcomics Magazine #6","stats":["24 pp","8.5x11\"","CMYK offset","saddle-stitched","printed by Marquis in Montreal"],"descriptions":["In-depth interviews between artists alongside essays and portfolios. Issue 6 features cover artist Kyung-Me, Michel Esselbrügge, Robin Vehrs, Helen Stefanie, Cynthia Alfonso, Óscar Raña, Julia Huete, and Kevin Huizenga. Rocky Bostick and Blaise Larmee interviews. Ed. Blaise Larmee"]},{"title":"An Honest Performance Will Dinski","stats":["24 pp","5x5.75\"","1, 2 color risograph ","printed by La Mano 21 in Minneapolis, MN"],"descriptions":["A brief meditation on representation and loss, thoughtfully composed yet seemingly tossed off."]},{"title":"Architecture of an Atom Juliacks","stats":["296 pp","7.1x10.8\"","CMYK offset","smyth-sewn hardcover","black gilded edges","printed by Imago in China"],"quotes":["\"Excessive, mysterious, wonderful, Juliacks work takes the graphic novel to a new and more plastic dimension.\"--Chris Kraus, author of I Love Dick, Torpor, Summer of Hate","\"Juliacks is a comic artist whose work--crude, ornate, subjective and dreamy--is not for those who prefer their narrative crisp and tidy.\"--The New York Times"],"descriptions":["ARCHITECTURE OF AN ATOM is a long, deep breath before a dive. It's a Piscean tale of survival, harrowing and surreal, a dreamlike escape, a delight. Dive into this pool of misfits and watch how wreckage becomes magic, hunger becomes adventure, and human questions about love, intimacy, and community unravel and manifest in beautiful washes of color. The language matches the vibrancy of the drawings and paintings that describes a cast of characters surviving on the brink of a disaster, in the end forming a magnificent poetic experience."]},{"title":"Cavities & Crevices Archie Bongiovani","stats":["8 pp","4x5\"","saddle-stitched","1-color risograph","printed by La Mano 21 in Minneapolis"],"descriptions":["A broadly sketched remembrance both confrontational and elusive, Archie's latest continues their deft ability to push and pull within a single beat."]},{"title":"Comets Comets Blaise Larmee","stats":["24 pp","4x5\"","CMYK offset","saddle stitched","printed by PN in China"],"quotes":["\"I feel myself getting further and further away from the truth of this comic with every word I write.\"--Shawn Starr","\"The exact opposite of the painful earnestness that inhabits some of the space of small press comics.\"--Sequential State \r\n\"Comets Comets is a mini drawn by Larmee in his Young Lions\/C.F. style, featuring an interview conducted by an unnamed young woman and 'celebrity artist couple' Hall Hassi and Davidson Middle. Not surprisingly, it's an imaginary interview with imaginary artists who discuss their imaginary careers using celebrity in conjunction with feminism, using tools like webcams to disseminate their work far and wide. Larmee deliberately uses heavy colors to obscure some of the lettering in the comic, refusing to grant the reader the privilege of knowing all that was said among the three characters. Hassi is an extended internet creation of Larmee's, who loves playing with the concepts of identity, fame and creation in an internet world where fame is arbitrary and viral, identity can shift or easily be hidden and manipulated, and repurposing art and images is more rampant now than ever.\"--Rob Clough"]},{"title":"Copy Kitty Kyung-Me","stats":["56pp ","12x8\" ","b&w, 1 color, CMYK offset ","hardcover","printed by Regent in China"],"quotes":["\"...intricate, hypnotic…\"--Selena Gallery","\"A shimmering fake moon, opulent costume changes, and Depression-era Art Deco set the backdrop for this spellbinding new narrative from Kyung-Me.\"--The Editorial Magazine","\"Kyung-Me's ultra-precise ink drawings, which resemble both Renaissance etchings and finely wrought computer-generated renderings, are windows into starkly glamorous modernist interiors.\"--The New Yorker","\"In a series of grayscale drawings, Kyung-Me renders every wood grain and textile fiber with ink, charcoal, or graphite in crisp detail, with no loss from foreground to background. The meticulous clarity is dizzying, even hallucinatory. With no singular focus or discernible narrative, the subjectless interior induces a horror vacui through its elaborate, often competing patterns.\"--The Offing"],"descriptions":["A CAT LOVES A BOY. He says he loves you too","'I fucking love you I fucking love you I fucking love you'","Can you believe it? Copy Kitty!","Hop in his convertible, and take a ride , Copy Kitty! Road-runner in the rear-view mirror. Paint his portrait! Wear your pearls! He's beautiful, isn't he?","Exquisite, intricate graphite drawings in landscape view. Chock-full of hidden details, little worlds of signification. Beautiful, opulent, emotional. An adult picture book comprised of intricate, surreal graphite illustrations that tell the tale of obsessive love and longing and the maddening, self-inflicted contortions of identity endured to fit perceived expectations and norms.","Copy Kitty explores themes of identity, belonging and love through a cat who painfully and continually reinvents itself in pursuit of adoration and an elusive ideal. Autobiographically driven, the narrative strikes a chord through common experiences conveyed authentically, with sharp perspective and deep reflection on the self-destructive consequences of perceived ideals and sublimation of identity.","The format of the book presents each of the highly detailed illustrations alternating with a blank page. Copy Kitty is based on a series of illustrations Kyung-Me exhibited at galleries in New York, which were met with strong critical acclaim. In 2018, work from Copy Kitty was featured in Artspace, having been selected on the favorites list from the New York NADA preview by prominent art collectors Susan and Michael Hort.","Kyung-Me is an artist and illustrator living in New York. She is represented by Bureau, NY.  She holds an MFA in painting from the Yale School of Art and has participated in numerous solo and group exhibitions in New York galleries and beyond. She is best known for her series of illustrations and debut graphic novel, Bad Korean, critically acclaimed by Vice, Huffington Post, and Hyperallergic."]},{"title":"Dragon's Breath MariNaomi","stats":["384 pp","6x9\"","2 color, b&w offset","perfect bound ","french flaps","printed by MCRL in China"],"quotes":["\"Award-winning author MariNaomi (Kiss and Tell) returns with this charming and intimate collection of vignettes and meatier personal histories. ... The book is utterly absorbing, funny, intimate, and even philosophical.\"--Publishers Weekly","\"The art sparkles, combining bold, clean lines with wonderfully expressive faces. Add in a great ear for dialog, and the result is a winning collection that brings the reader genuine laughs and a powerful emotional punch. MariNaomi is definitely a name to watch in the years to come.\"--Library Journal","\"Dragon's Breath is a funny, intimate and sometimes sad ode to multiplicity. Each episode comes over you like a puff of smoke, and with it comes both a little cough and the rich scent of fresh tobacco.\"--Graphic Novel Reporter","\"MariNaomi knows how to weave in a sense of the comic, so that moments of deep despair are always balanced with some levity and even mirth ... A highly recommended read from a new and exciting independent publisher.\"--Asian American Literature Fans","\"Mari's comics are a special, one-of-a-kind thing. They live in this mesmerizing area of honesty and authenticity ... their quality is wildly impressive and present throughout.\"--This Is Infamous","\"MariNaomi cuts to the quick with her emotionally resonant comics collection that offers variety and a comforting voice.\"--Foreword Reviews","\"As a memoirist, MariNaomi has wit, focus, and a sense of when to stop telling a story. The comics in Dragon's Breath are both compact and emotionally resonant.\"--The Comics Journal","\"Different comics in Dragon's Breath will cause different reactions depending on your experience, but it's bound to touch you somewhere.\"--Panel Patter","\"Mari is a brilliant artist, compelling storyteller and bonafide dragonslayer.\"--Brodie Hubbard","\"What is so appealing is how MariNaomi shares a life, one that is distinct in its details, yet connected. Here is another woman searching for love, risk, and connection amid the hubbub of the contemporary--boyfriends, best friends, bedbugs, exes, rock music and rentals.\"--Bookslut","\"[MariNaomi] reminds us about those special fleeting moments of beauty and those dark places in our psyches that we bury.\"--The Great Comic Book Heroes"],"descriptions":["In this collection of raw, emotionally honest stories, MariNaomi explores a wide range of topics including youthful rebellion, mortality, disillusionment, and compassion. Many of these stories were first serialized on the popular site the Rumpus. These poignant stories, some filled with hope, others tinged with remorse, are sure to appeal to even the most discerning reader."]},{"title":"Extended Play Jake Terrell","stats":["112 pp","6.2x8\"","1, 2, & 5 color offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"'Extended Play' is an apt title. The pleasure of Terrell's line, and his storytelling, is infectious. It's a battle cry for cartooning as mark making, as line design, for thinking of drawing as handwriting and a form of searching and discovery. It may be his first book, but already he seems to understand what IT is, better than most. I could read his work all day long.\"--Sammy Harkham"],"descriptions":["Extended Play, the debut collection by Jake Terrell, seizes upon the millennial zeitgeist from an array of angles. From the haze of summer to the conflicting feelings of ennui and hope that guide the figures in Terrell's magical realist landscapes, there's an effortlessness to his work that obscures the heightened sense of understanding he brings to the form. Jake Terrell is a cartoonist and illustrator based in Brooklyn, NY. His comics have a loose, confident line, often focusing on a youth-centric cast of characters written into magical realist or measured fantastical narratives."]},{"title":"Fluorescent Mud Eli Howey","stats":["116 pp","7x10\"","CMYK offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"Eli Howey's Fluorescent Mud pulls the reader in with drawings so haunting and hallucinatory that the pages seem to pitch and swell, like the surface of the ocean at night lit up by bioluminescent algae. As I read, I felt that I was becoming a presence in the mind of the protagonist, looking over their shoulder while they navigated eerie moonlit landscapes, and vividly sensing the intensity of their turbulent mental state.\"--Sophia Foster-Dimino, Sex Fantasy","\"Eli paints dissociation like nobody else. Their work is lush and queasy, and makes me feel like I'm having a panic attack. Fluorescent Mud is a work of genius, and it hits really really hard.\"--Carta Monir, cartoonist and podcast host"],"descriptions":["Entirely hand painted in watercolor and gouache, Fluorescent Mud is a surreal art comic with underlying themes of transition and dissociation.","Flourescent Mud follows the main character through a series of seemingly unrelated and unexplainable experiences, taking into account various states of mind\/memories\/ thoughts\/feelings and sensory experiences that affect a subjective retelling of events.","Eli Howey is an artist and printmaker currently based in Toronto. They use traditional analogue printmaking techniques to create contemporary narrative artbooks and large-scale works on paper. They use a combination of images and poetry to construct narrative artwork that expresses multiple dimensions of each situation. Their work attempts to go beyond what can be seen, to incorporate the emotional and imagined spaces within environments and stories."]},{"title":"Gulag Casual Austin English","stats":["160 pp","7x10\"","CMYK offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"The Ultimate Graphic Novel For Artists, Weirdos And Renegades.\"--Huffington Post","\"Dirty erasures, tense scrawls, and compulsive stretches of pattern seethe with intensity and urgency and rub up against profound bewilderment.\"--Bomb Magazine","\"Unique and vibrant and seductive-to-the-curious.\"--The Comics Journal","\"Dirty erasures, tense scrawls, and compulsive stretches of pattern seethe with intensity and urgency and rub up against profound bewilderment.\"--Bomb","\"Is your style a reaction to--or even a rejection of--more traditional comics storytelling?\"--Andy Oliver","\"Anything resembling a typical comic vocabulary is being abandoned.\"--Comics Bulletin","\"Austin English's drawing is gelatinous, daubed, stroked, smeared, erased, redrawn, sculpted, twisted, cringes, flattens out as it squashes inward, maybe reminds one of a landscape and populace for Stravinsky folk songs, or a dream program for tragic Polish puppet plays, crowded, self-replicating and worth checking out.\"--Gary Panter","\"A thoughtful artist pushing at the boundaries of what modern comics will accept in terms of an artistic approach.\"--The Comics Reporter"],"descriptions":["6 years in the making. Finally here. Full color. Uncompromising. The new book from Austin English. Featuring New York Story and four more. Designed by Best American Comics editor Bill Kartalopoulos."]},{"title":"Gustave Flaubert Trois Contes Christopher Adams","stats":["24 pp","5x7\"","1 color risograph","saddle-stitched","printed by Perfectly Acceptable in Chicago"],"quotes":["\"'Gustave Flaubert Trois Contes' beguiled me on my first read and opened up to greater and greater depths on each return visit. It is a funny and complex book about the porous border between art and life that operates on more than trois levels--a comic about its own making whose self-awareness is intimate and revelatory.\"--Conor Stechschulte, author of Generous Bosom","\"Wtf did I just read? I've gone back to it over and over and the details get funnier and more bonkers with each pass. There are so many subtleties, it's not for the casual reader. Must pace with pure joy, this arcane glimpse into the mind of Chris Adams.\"--Melissa Foley-King, librarian at the Harford County Public Library","\"haha wow this is really weird chris. ok oh jeez i've never tried to blurb before it's harder than i thought! if you enjoy a one-word blurb i would say 'disorienting' which i mean as a compliment but it might not read that way i guess? dunno? i put a letter complaining about how my comics suck on the back of my book so i might have a different approach to this than someone else in general i now realize lol or how about: 'Like finding out you're the people in Powers of Ten just before getting kicked out of the theater you're watching it in.' i worked on that one! is that a blurb? i might not know how to do this also can i just say i am in love with this radiator you drew i don't know why\"--Dina Kelberman, creator of I'm Google"],"descriptions":["Drawn with ball point pen in late 2016, Gustave Flaubert Trois Contes is lent a level of immediacy with its stream of consciousness narrative. A seahorse guides the reader through CB radio chatter, intimate apartment living, dinosaur sitcoms, and the authors own memories. ","Christopher Adams is an artist and musician. He has published several books with 2dcloud including. 'Strong Eye Contact' and 'Yule Log', both listed as 'Notable' in Best American Comics."]},{"title":"How it Happened Jason T. Miles","stats":["24 pp","5x7\"","saddle-stitched","1-color risograph","printed by La Mano 21 in Minneapolis"],"quotes":["\"I loved your memory comic.\"--Gary Groth","\"How it happened remembers the precious moments like we do.\"--Kim Jooha","\"The new comic--How It Happened--great.\"--Dash Shaw"],"descriptions":["How it Happened careens through memory and friendship like a wistful comet over the night sky. There and gone."]},{"title":"I Don't Hate Your Guts Noah Van Sciver","stats":["28 pp","5.5x8.5\"","4 color offset","saddle stitched","printed by Print Ninja in China","30 Days in the life of Noah Van Sciver."],"quotes":["\"Projects a moment of contentment that will make any reader smile.\"--Comics Bulletin","\"Brought to visual life in Van Sciver's customarily unostentatious but highly expressive and detailed cartooning style, “I Don't Hate Your Guts” has a most unlikely charm ... this one's an absolute must-buy.\"--Broken Frontier","\"This collection of diary comics by Noah is loaded with self-loathing, sharp humor and romantic charm.\"--Largehearted Boy","\"[S]ome of the best $5 you spend a[ll] year.\"--Panel Patter","\"Watch as Noah slowly implodes into a tragically self-destruc…WHAT THE?! He gets a girlfriend?!!?!\"--Neil Brideau"]},{"title":"ITDN Andrew Burkholder","stats":["192 pp","5.5x7\"","b&w offset","smyth-sewn","poster 7x19.5\"","printed by TWP in S. Korea"],"quotes":["\"One morning at a gig space in Baltimore I watched Andy Burkholder pick up a tube of leftover frosting and use it to casually draw a simple but legible comic strip onto a piece of cardboard. His uninhibited intelligence and direct style create the conditions for breakthrough work. ITDN is the laboratory from which his later achievements have emerged.\"--\r\nBill Kartalopoulos, series editor for Best American Comics","\"A safari through the wilderness of human behavior.\"--\r\nAnna Haifisch, author of The Artist","\"Broad range.\"--Publishers Weekly","\"One of the most profound aesthetic experiences I've had in the medium in a long time.\"--Daniel Elkin","\"[A]n objectified acid flashback [...] that will boggle your mind...\"--San Diego Book Review"],"descriptions":["ITDN Group published a series of comics pamphlets from 2010--2014. Each issue was anonymously authored and included the possibility of being created by a different person. The 'group'--plural, informal, and rigid--is the only thing cohering the series together. A follow-up to Qviet, this collection documents Burkholder's earlier years, providing insights into his explorations of the themes and concepts that underpin many of his more broadly received works."]},{"title":"It Felt Like Nothing Fifi Martinez","stats":["24 pp","5x8\"","CMYK offset","saddle-stitched","printed by Print Ninja in China"],"quotes":["\"Anyone can feel the soft, painful vulnerability in Fifi Martinez's work. The brash depictions of her personal relationships and lonely, depressive internal monologue emit an honest intensity that can make anyone reflect on their past life with tears. Her frantic line work and obsessive layering carries the reader through the anxiety of her life. Fifi's persistent growth as an artist and person can only inspire hope in the insecure and miserable.\"--\r\nLizz Hickey, author of Jammers"],"descriptions":["A small zine that feels like a cassette demo, filled with short unfinished first take tracks about love, heartbreak, and feelings.","Past lovers bleed into one another as moody sketches and hazy memories. It Felt Like Nothing is both colorful and murky, much like unrequited love.","Fifi Martinez is a cartoonist and musician based in San Diego."]},{"title":"Lost in the Fun Zone Leif Goldberg","stats":["184 pp","8x5.1\"","2 color offset","smyth-sewn flexibound","o-wrap","printed by TWP in S. Korea"],"quotes":["\"I think Leif Goldberg made Lost in the Fun Zone using automatic writing--after absorbing all art of the twentieth century and comics from the past forty years. How else do you get Dubuffet, synthetic cubism, Garfield, Italian Futurism, Luis Buñuel, and Gary Panter in a story about two cats traveling a digressive and banal path to nowhere? It's boldly weird. Goldberg has hijacked the comics form, for its benefit and ours.\"--Nicole Rudick, Managing Editor at The Paris Review","\"Alleluia!!! Our favorite Artist has made a Graphic novel unlike any other. Going Commando in Black'n'White Rodeo style, the better to spin his lasso spiderweb of narrative, Goldberg performs the great trick of steering time neatly down two railroad tracks. A metamorphosis per page, at the speed of synapses sprouting digression radicles... This story echoes, spins, and convulses with a thousand sweaty puns- you will laff on the bus, in the bathroom, and at Harvard. Truly unlike no other artist in the galaxy (Borblefluzz is related).... Do you want to understand the world by walking through a pumpkin? Is your favorite drug Funny Animals?... Well then get 'Get Lost'!!!! To Find Yourself!! in the Fun Zone!!!\"--Matthew Thurber"],"descriptions":["Lost in the Fun Zone is the long-awaited debut graphic novel from respected underground printmaker, animator, musician, and zinemaker Leif Goldberg. Transposing buddy and road film dynamics into the world of underground art comics, Goldberg adroitly balances absurdism with cultural snark and art history commentary to produce a book worthy of its name.","Leif Goldberg is a visual artist and musician living in Vermont. As a member of the highly influential art-collective Fort Thunder based in Providence, RI in the late 1990's and early 2000's, Goldberg is known for his bold screenprint work as well as experimental animation and contributions to the band Forcefield, who were part of the 2002 Whitney Biennial."]},{"title":"Margot Ferrick Tote","stats":"14.5x15x5\" art by Margot Ferrick 100% cotton canvas 22\" handles reinforced bottom"},{"title":"Mirror Mirror 1 Blaise Larmee","stats":["192 pages","6.93x9.84 inches","1, 2, & 4 color offset","smyth-sewn","poster (27.83 ✕ 19.69 inches)","printed by TWP in S. Korea"],"quotes":["\"I loved this collection. Spare pieces about identity and interiority. It reads like an auditory experience.\"--Sam Alden","\"Dense, complex visual essays that demand sustained attention from the reader.\"--Hyperallergic","\"The objective, we might surmise, is to access a state of mind or emotion smothered beneath the gloss of 'finished' comics in the traditional sense--but this is an old notion, and my understanding is that many of these artists are quite young. Their works seem more like ambient considerations of what the self is, the art withdrawn a ways between the realms of consideration and completion.\"--Joe McCulloch"],"descriptions":["The luxury book. All white. Lyrical drawing. Lyrical poetry. Libidinal drawing. Embodied practice. First person drawing. Third person drawing. Cartoonist turned poet. Mirror as tampon."]},{"title":"Mirror Mirror 2 Sean T. Collins & Julia Gfrörer","stats":["240 pp","6x9\"","Pantone black offset","flexibound","black gilded edges","printed by TWP in S. Korea"],"quotes":["\"A thought-provoking, richly entertaining collection from some of the most exciting comic artists working today. A must read for fans of the horrific and perverse.\"--Bryan Cogman, co-executive producer\/writer, Game of Thrones","\"An impressive collection of beautiful depictions of grotesque things and grotesque depictions of beautiful things.\"--Alan Resnick, writer director, Adult Swim's Unedited Footage of a Bear and This House Has People in It","\"Great horror is the pursuit of meaning through defilement, a conscious and inquisitive violation of the mind, the body, the beloved, the home; the concentric circles of security that comprise our lives. Great porn proceeds from a similar root, grappling with that which delights and with that which abases in the context of their inextricability.-.\"--Gretchen Alice Felker-Martin (from the foreword)\r\n\"This book is like a porn stash you'd find in the cupboard of a medieval demon. It feels truly forbidden, and reading it induces an exquisite sense of deviance.\"--Hyperallergic","\"Mirror Mirror II invites the most innovative creators working in the form today and proves just how expansive the pornographic and gothic can be, encapsulating the pop cultural, fantastical, and realistic in one fell swoop.\"--Rachel Davies, Rookie Magazine","\"Editors Sean T. Collins and Julia Gfrörer have assembled an exquisitely creepy and seductive new collection of comics with Mirror Mirror II. From Uno Moralez's pixilated noirs to Dame Darcy's ornate Gothic ghost stories, the wide range of horror here is fantastic, as characters creep and fuck in the shadows of unimaginable darkness throughout. It's certainly the perfect, freaky anthology for you, your lover, and all the demons in your mind.\"--Hazel Cills, MTV News"],"descriptions":["For volume two of 2dcloud's annual anthology, editors Julia Gfrörer & Sean T. Collins have amassed some of the darkest talents within as well as outside of comics to create a wholly singular reading and visual experience. From masters of horror like Clive Barker to leading figures in altcomics such as Simon Hanselmann, this collection transcends the expectations of what a comics anthology can do.","Lala Albert • Clive Barker • Heather Benjamin • Apolo Cacho • Sean Christensen • Nicole Claveloux • Sean T. Collins • Al Columbia • Dame Darcy • Noel Freibert • Renee French • Meaghan Garvey • Julia Gfrörer • Simon Hanselmann • Claude Paradin • Aidan Koch • Laura Lannes • Céline Loup • Uno Moralez • Mou • Jonny Negron • Chloe Piene • Josh Simmons • Carol Swain • Trungles"]},{"title":"Mirror Mirror 3 Plum","stats":["108 pp","6x8\" ","CMYK offset ","smyth-sewn","printed by Regent in China"],"quotes":["\"This is not a comics anthology that just compiles various contributions by different artists but rather one that can only exist as one piece, one that was created by three parts of one body with a shared vision. These stories don't make you see the individual artists behind them--these stories want to tell you that they created themselves and will keep recreating even after you put the book down. A living organism of the most convincing examples that show how masterful and unpretentiously poetic comics can be.\"--Aisha Franz, author of Shit is Real","\"Lush dancing forms in kaleidoscopic color and style, Mirror Mirror 3 is animated, playful and delicious. A collection of delightfully joyous work vibrating with creative vigor. An ornate dream box of beautifully wrapped candies you've never tried before.\"--Lale Westvind, author of Grip"],"descriptions":["Mirror Mirror 3 is a vibrant maelstrom of mixed media, arriving at a stunning intersection of innocence, joy, and color. ","The third volume of 2dcloud's flagship anthology is created in partnership with Plum, a Brooklyn-based artist collective and publisher. This volume of the anthology series is divided into three sections, one by each of the Plum artists, with collaborative work connecting the stories. Themes throughout include nature, introspection and interpersonal relationships. Plum's imagery is vibrant, emotive, and mythic. ","Plum Press is a small press located in Brooklyn, NY. They publish comics, zines and other printed materials and products. They host events and work in a variety of media. Plum is run by Haejin Park, Paige Mehrer, Sophie Page."]},{"title":"Motherlover Raighne","stats":["72 pp","5.5x7.5\"","1, 2, 4 color offset","perfect bound","printed by Bang Printing in Brainerd, MN"],"quotes":["\"[Motherlover] has a way of evoking dread and malaise in equal measure.\"--Rob Clough","\"Breutzman's style is unusual in that he mixes naturalism in terms of his backgrounds and character designs with slightly loose, rubbery expressions on his characters' faces.\"--The Comics Journal","\"...the world is weird and the world is uncomfortable.\"--Comics Bulletin"],"descriptions":["Motherlover is a tightly-knit anthology, modeling itself off of Drawn & Quarterly's since retired annual showcase. This one-off volume pairs Minnesotan creators Nicholas Breutzman, John & Luke, and editor Raighne together for woodsy and weird excursions in dark comedy. Mood rings, disaffected twenty-somethings in NYC, unsupervised nine-year olds in the pursuit, nay, NEED, of finding a porno tape, and suburban white boys buying fake crack--Minnesota's finest!"]},{"title":"Nocturne Tara Booth","stats":["64 pp","5.8x8\"","4 color offset","hardcover","printed by TWP in S. Korea"],"quotes":["\"Tara understands the language of comics fully. Her stories slide past the analytical part of the brain and directly into a deeper, more gratifying kind of understanding. Her bright colors bring joy and humor to the heaviest, darkest follies hidden inside ourselves.\"--Gabrielle Bell, author of Everything is Flammable","\"As an artist, Booth works to push the boundaries between comic arts and fine art, and she lives up to no standards of appropriateness other than her own. Her social commentary is sharp and her visual storytelling unassuming.\"--Megan St Clair, Hyperallergic","\"Comic book artist and illustrator Tara Booth's work is candid, funny and chock full of personal details. The textures and patterns she achieves using gouache paint give her work a wonderfully awkward tone and she brings her characters to life through short vignettes that unfold on the page.\"--Rebecca Fulleylove, It's Nice That"],"descriptions":["Unable to sleep, Tara takes too much sleep medication and enters a dream soaked fantasia. A vivid and moody, euphoric journey where dreams and hallucinations intersect.","In this wordless graphic novella, Booth covers autobiographical themes of mental health, anxiety, and issues of consent. Nocturne is Booth's first wide release, following her critically acclaimed, short-run debut, DUII.","Tara Booth is a 28 year old illustrator and comics artist from Philadelphia. Her work has been featured on Mashable and in Bloomberg Magazine, Hi Lo, and The Lifted Brow, among other magazines and websites--but she's probably best known for her content on Instagram, where she has over 60K followers. Her work was recognized and featured by It's Nice That as part of World Mental Health Day in 2017."]},{"title":"Out of Hollow Water Archie Bongiovanni","stats":["104 pp","6x6\"","2 color offset","perfect bound","french flaps","printed by McNaughton & Gunn in MI"],"quotes":["\"A shadow smeared dream-cycle rife with haunting symbolism.\"--The AV Club","\"An unsettling and haunting debut.\"--Publishers Weekly","\"Just from looking at Bongiovanni's style, you know you're about to experience something deeply personal.\"--Autostraddle","\"There's a beautiful eeriness to Bongiovanni's work that I find irresistible. Like an old black and white film about some forgotten fairy tale.\"--Noah Van Sciver","\"Haunting, disturbing, breathtaking and beautiful--this is a story that will stay with you.\"--MariNaomi","\"Archie's scratchy, understated line unerringly evokes helplessness, violation, and a lingering sense of psychic revulsion, dropping the presumed morals out from under you and then implicating you in the inevitable disaster. The effect is smart, chilling, viscerally disturbing but never showy or cruel.\"--Julia Gfrörer"],"descriptions":["Out of Hollow Water, the debut book by Archie Bongiovanni, is an exercise in the fantastical and intensely personal, plumbing hidden depths both real and imagined. It is a work that wanders into the dark recesses of the female experience, where the only escape is through cathartic release, taking myriad forms. This book draws and expands upon themes Bongiovanni has cultivated in past works, while signaling a shift in presentation. Moving from the rough, scratchy inked pages of their minicomics to the hazy imperfection of pencil on vellum, Bongiovanni has constructed a space befitting their oblique narratives. This triptych of stories showcases a stark, emergent voice in the ever growing world of comics, one worth following down whatever path they might take you."]},{"title":"Perfect Hair Tommi Parrish","stats":["72 pp","6.2x8.9\"","CMYK color offset","smyth-sewn","spot gloss on cover, o-wrap","printed by TWP in S. Korea"],"quotes":["\"Parrish is great at making panels that you can both read and linger over. The locations and bodies are exaggerated to reach a more realistic and sensorial state. This is an awesome debut comic.\"--Dash Shaw","\"Parrish has one of my favourite traits in a cartoonist: intense passion for the craft. They are rapidly evolving and experimenting wildly and it's joyful to watch.\"--Simon Hanselmann","\"Lonesomeness, dread, selfhood--these are some of the main themes touched upon in the 72 pages of Perfect Hair. These topics are never easy to talk about or even comprehend, but Parrish fully realizes them and with surefooted confidence, doesn't shy away from anything, delving deeper and deeper into distressing psyches.\"--The Comics Journal","\"Parrish's art excels at worrying these boundaries between symbolic thinking and actual experience, endowing big, clayey bodies with rarefied grace.\"--The Globe and Mail","\"In Perfect Hair you see what you hate most about yourself, and it reminds you how strong you are as you make your way through.\"--Tiny Pages Made of Ashes"],"descriptions":["This is an audacious debut by Parrish. It's interesting that Dash Shaw offered up a blurb, because among the many influences that Parrish cycled through in the course of this book, Shaw was the most significant. The layout, the use of diagramatic text, the use of textual onomatopoeia in place of more typical sounds effects, and simple line are all there--except when they're not. Eleanor Davis is another obvious influence, and there may be hints of Gary Panter, Chris Ware and many others. What's remarkable is the way they are able to dial in and out of a particular visual style, often in the middle of a story. In 'Train Scene', Parrish begins with a naturalistic color setting at the station, then switches to a pencils-only page, and then to the big, blobby character design they use for much of the book. In other words, the 'real' image, the self-image, and the way she looks at others. The result is a style for Parrish that becomes uniquely theirs, whipping the reader from narrative fragment to narrative fragment while still retaining a cohesive set of character profiles.","A vivid cross-section of relationships, identity, and the gradations of emotion that color them.","Tommi parrish is a cartoonist who lives in-between Melbourne, Australia and Montreal. Their work has appeared in various anthologies, magazines, mini comics, gallery shows in New York, Argentina, and throughout Australia. Tommi has work in the permanent collection at the gallery of Western Australia and has presented talks and workshops for the Melbourne Writers Festival, the Emerging Writers Festival, and the Girls Write Up Festival."]},{"title":"Powerpaola Tote","stats":["14.5x15x5\"","100% cotton canvas 22\"","handles reinforced bottom"],"descriptions":["art by Powerpaola"]},{"title":"Powerpaola tee","stats":"100% ringspun cotton ","descriptions":["Art by Powerpaola"]},{"title":"Qviet Andrew Burkholder","stats":["248 pp","5.5x6.8\"","2 color offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"Burkholder uses line in fresh and startling ways to cast new light on humanity's most enduring obsession.\"--Anya Davidson, author of Lovers in the Garden and School Spirits","\"This book will fold your brain like a paper crane.\"--Lane Milburn, author of Twelve Gems","\"These are surrealist inner monologue gags of the id, thoughts projected, constructed in the finest kinky lines.\"--Lale Westvind, author of Grip","\"A truly funky affront on comics form.\"--Scott Longo, artist and publisher","\"Fresh, urgent, ephemeral.\"--The Comics Journal","\"Qviet takes sex and does to it what it does with its own rubbery, loose-lined, exuberant, exhilarating cartooning: twists it, stretches it, turns it inside out, makes unexpected connections, uses it to reveal things that usually stay hidden away.\"--The Comics Journal"],"descriptions":["Qviet focuses on the abstractions of sex, of seeing, and the fluid relations between the two. Using the strip, one of the oldest formal modes in comics, as the misleadingly benign container for his explorations, Burkholder challenges the reader to reimagine not only what falls under the purview of this form, but the larger conceptions of sex as a whole.","Andrew Burkholder is a cartoonist and visual artist. His comics are abstract yet playful, oftentimes dealing with very adult themes twisted through an extremely dry sense of humor. His 2013 comic Pretty Smart was included in the Jonathan Lethem edited Best American Comics 2015."]},{"title":"Retreat Jaakko Pallasvuo","stats":["104 pp","8.25x11.7\"","CMYK offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"Jaakko Pallasvuo has a gift for rendering the anxiety of contemporary life with complicated sincerity. He blends art-world satire and queer tragedy with a cosmic sensibility that can ruminate on ecological deep time and crack absurdist jokes on the same page. Retreat is his most accomplished comic to date: an ambitious, fully-realized post-apocalypse narrative in lush, impressionistic watercolour. Like everything he makes, I adore it.\"--Saelan Twerdy, critic","\"Currently nothing excites me more than a new project from Jaakko. I don't care if he's making films, masks, comics or papier mache hats, I'm in for anything, but I'm very happy he's come back so strongly to comics over the past few years. I generally find his stories of 'pretentious groups of art-people' to be actually very unpretentious and quite matter of fact. I found RETREAT to be propulsive and full of emotion and 'social action'. It made me feel for the characters. It felt real. And most importantly: I LOL'd. <|:-) (i heard a rumour that james van der beek purchased the screenplay rights in a secret google hangout..\"--Simon Hanselmann, author of Seeds and Stems"],"descriptions":["The angst, ennui, and malaise of the queer apocalypse sublimated to the equally ravishing graphic novel.","A gay couple flees the city from the impending apocalypse. They meet another artist on the way. Their clashing relationships, emotions, ideologies, hopes, and plans all transform unpredictably at the twilight of the human race. Jaakko Pallasvuo tells the convoluted and beautiful drama in the face of oblivion with stunning colors and visual and literal innovations in the way that are only possible in contemporary comics.","Jaakko Pallasvuo is a Finnish artist and novelist working in painting, sculpture, video, photography, books, and digital media. He has exhibited his work all around the world including Whitney Museum of American Art in New York City, Berlin, London, Paris, Stockholm, Warsaw, and Seoul. His previous graphic novels are Pure Shores and Easy Rider, both by British artist book publisher Landfill Editions. "]},{"title":"Rudy Mark Connery","stats":["240 pp","6.25x8\"","2 color, b&w offset","perfect bound","printed by MCRL in China","Edited and Designed by Marc Bell","Foreword by Samuel Andreyev"],"quotes":["\"Rudy is the best.\"--John Porcellino, author of King-Cat","\"Intuitive and spontaneous rather than practiced and formalistic,[these] hilarious, doodled-in-a-notebook-style comics emerge triumphantly from the id.\"--The Comics Journal","\"A comedic timing worthy of Bushmiller has been transplanted into an anarchist scratch-scape… I LOVE RUDY.\"--Matthew Thurber, author of Art Comic","\"After reading Rudy, my brain began to rewrite itself... Connery inverted my artistic values...\"--Jim Munroe, author of Sword of My Mouth, and Therefore Repent","\"When I first saw his work it felt truly and completely new. And the funny thing is, reading the material in this book over a decade later, it still feels that way.\"--Anders Nilsen, author of Tongues, and Big Questions"],"descriptions":["Rudy, a collection spanning over 20 years of comics and zines by Mark Connery, is a delightfully strange, funny, and metaphysical trip. With pants-wearing fish, shape-shifting triangles, talking eyeballs, rude ugly duckling youths, and of course our titular magic cat, Rudy, Connery's absurdist irreverence permeates his work. With the turn of every page, Rudy beats with a poet's heart. Words alone cannot capture the magic that is Rudy. It must be read to be believed!"]},{"title":"Röhner Max Baitinger","stats":["216 pp","6x8.2\"","b&w, 2 color offset","smyth-sewn softcover","poster 18.75x8.2\"","printed by Regent in China"],"quotes":["\"Röhner expertly shows off Max's inventive draftsmanship, droll wit, and precise cartooning. It's one of my favorite books for 2020.\"--Gina Wynbrandt, author of Someone Please Have Sex With Me","\"Max is such a good observer of interpersonal relations, and therefore a great storyteller. Needless to say that his drawings are magnetic. I keep staring at them and think: How did he do that? Röhner is one of my favorite books.\"--Anna Haifisch, author of The Artist","\"Designs whole worlds with a few lines.\"--Sabine Danek, Critic"],"descriptions":["Baitinger leaves the reader in the dark about the big picture. He prefers to show details: how the protagonist spins his appointment calendar in the air to indicate that he has no time. The way aluminium confetti pours out of a letter onto a shag rug. Baitinger breaks up an everyday matter like brewing coffee into many small steps, each in an individual image: Switch on boiler. Insert pot. Fill tank. Insert filter.--Josa Mania-Schlegel, journalist at Krautreporter","Previously published in German by Rotopol Press, Röhner is a delightfully detailed field guide to the every day tasks of living in an apartment--making coffee, watering plants, and maintaining order and a careful balance with neighbors--until that order is upset.","Max Baitinger's dry humor and precise drawings deftly personify his über persnickety protagonist, simply referred to as P., whose regimented life is disrupted by the arrival of Röhner, an unloved houseguest, who imposes upon his psyche and offsets the careful balance with his gregarious, omnipresent neighbor. Devious tricks and hilarious imaginations of Röhner's elimination take shape, from painstakingly making up Röhner's guestroom and then piercing the air mattress to cause a slow leak--to visions of an exploding coffee pot tearing off Röhner's face."]},{"title":"Sec Margot Ferrick","stats":["32 pp","5.5x8.5\"","4 color offset","saddle stitched","printed by Print Ninja in China"],"quotes":["\"Illuminating.\"--Aaron Turner","\"It floored me, so beautiful and intimate and visceral. reading it was like being submerged in an ocean of blood, listening to a heart beating and organs pumping and squelching.\"--Laurie Piña, author of","\"Margot Ferrick is doing some of the most intimate and innovative comics out there.\"--Shawn Starr, critic","\"When sometimes I feel dead inside, Margot's comics wake me up.\"--Erik Nebel, author of Well Come","\"Margot Ferrick is one of my favorite cartoonists.\"--G.W. Duncanson, author of"],"descriptions":["Margot Ferrick is currently producing what may be the last in a series of love letters chronicling 2014--2016. In Sec, their penultimate letter, Ferrick reaches a fever pitch of desire."]},{"title":"Someone Please Have Sex With Me Gina Wynbrandt","stats":["140 pp","5.1x6.5\"","1, 2 color, CMYK offset","smyth-sewn","printed by TWP in S. Korea"],"quotes":["\"It's impossible not to fall in love with this hilarious minx as she lunges across the page, nostrils flared, hurling herself into increasingly ridiculous romantic misadventures. Bow down to Gina as she explores what it means to be horny as hell!\"--Lisa Hanawalt","\"An intense, weird, vulnerable dive into the underbelly of young adulthood.\"--Paste Magazine","\"Absurdly honest.\"--The Globe and Mail","\"Gina isn't cardboard. She is equal parts bravado and self-doubt, raging id and little girl, a figure you want to throttle but also hold close.\"--Los Angeles Times","\"The blackest humor here lies in the chasm between theory and practice: desperation spirals, the grotesquerie of her drawings increases.\"--The Comics Journal","\"Wynbrandt is a force of nature as a cartoonist, evincing a fully-formed toolbox of drawing and storytelling skills, a razor-sharp sense of humor, and (contrary to the image she portrays) a powerfully developed sense of self.\"--Rob Clough","\"A diverse set of whirlwind narratives, uniting unconventional beauty tropes, celebrity stalking, internet culture, and even bestiality.\"--Hyperallergic","\"A fascinating and irreverent take on what it's really like to be an unconventional woman with real physical needs in a world where highly prescribed expectations of femininity and sexuality are still too prevalent.\"--Fusion","\"Someone Please Have Sex With Me plays with conventions of style and color, featuring pleasingly feminine sherbet-y tones juxtaposed against a story line about a woman looking for love in all the wrong places--in all the wrong ways.\"--Los Angeles Times","\"How would you explain your relationship with these teen heartthrobs?\"--Chicagoist","\"How's your relationship with the Biebs now?\"--Paste Magazine","\"Talk a little about Manhunt, the book's new story, which is about a fictional video game. Why did you decide on that approach?\"--CBR","\"Smart, wickedly funny, and transgressive. More comics like this, please!\"--John Porcellino"]},{"title":"Sound of Snow Falling Maggie Umber","stats":["104 pp","6.8x8.5\"","CMYK offset","flexibound","printed by TWP in S. Korea"],"quotes":["\"Mesmerizing... As in nature, the more you look, the more you see.\"--Julie Zickefoose, author & illustrator of Baby Birds: An Artist Looks Into the Nest, The Bluebird Effect: Uncommon Bonds with Common Birds, and Letters from Eden: A Year at Home, In the Woods","\"Umber beautifully uses comic form to take the reader through intimate movements in nature.\"--Aidan Koch, author of After Nothing Comes","\"Umber has captured a small reflection of the natural divine.\"--Tiny Pages Made of Ashes","\"Umber's thrillingly inventive approach to cartooning constitutes an act of real empathy with the earth, an attempt to embrace the alterity and sovereignty of the sentient life that surrounds us.\"--The Globe and Mail","\"Est-ce que tu as cherché à figurer la vision animale?\"--Les cahiers du bruit"],"descriptions":["A paint and paper documentary, observing great horned owls in their natural habitat.","Sound of Snow Falling is a graphic novel done in a poetic documentary mode. In this unique work, the reader becomes a voyeur of the natural world, following a great horned owl family through the dead of winter. Extensively researched and expressively painted, Sound of Snow Falling is a triumph of the comics form.","It is a BEST AMERICAN COMICS 2018 Notable title, selected by Bill Kartalopoulos.","Maggie Umber is a cartoonist and a co-founder of 2dcloud. Sound of Snow Falling is her second graphic novel."]},{"title":"Startled Maggie Maggie Umber","stats":["34 pp","5x7\"","saddle-stitched","CMYK offset cover, 1 color interior","printed by La Mano in Minneapolis"],"quotes":["\"This has the potential to be a downright fascinating series when all is said and done.\"--Optical Sloth","\"The way [Umber] draws her parents as having blank eyes behind their eyeglasses is almost as perfect as the way she draws herself: a crazy-haired curmudgeon with either a glint of mischief or a permanent scowl on her face.\"--Rob Clough, critic","\"[I]t's hard not to fall prey to the charm of this book.\"--Justin Giampaoli, Poopsheet Foundation"],"descriptions":["Startled Maggie made the Salon Saloon's Heavy 100 list for 2012.","Startled Maggie is an auto-bio serial focusing on a mischievous little spit-fire. Drawn in light pencil, this new series is pointed at the ephemeral qualities of memory and what makes early life such a funny and charming place.","Cover colors by Raighne."]},{"title":"Summer Carnival Jake Terrell","stats":["24 pp","5x7\"","1 color risograph","saddle-stitched","printed by Perfectly Acceptable in Chicago"],"quotes":["\"Really liking this.\"--Sammy Harkham","\"I want to whisper through the feathery light hair of Jakes Terrell's characters. They're beautifully drawn!\"--Anna Haifisch","\"Jake Terrell has spent his time well learning to manipulate a fine pen line so that it resembles the amorphousness and confusion of daily life and human interaction. In his work I feel the dizziness of knowing other people.\"--HTMLFlowers"]},{"title":"The Necrophilic Landscape Tracy Auch","stats":["32 pp","7.75x9.25\"","1 color risograph","saddle-stitched","printed by Perfectly Acceptable in Chicago"],"quotes":["\"Finally, we are permitted to peek into the horrid pile left in the bin outside the building of the former Xeric grant office. The building has been closed for a while now, and like one would expect, the state of this original manuscript has been compromised considerably over the years, some might even say 'edited' by the forces of nature.\"--Noel Freibert","\"THE BODY TAKING PRECEDENCE OF THE SOUL...THE MANNER SEEKING TO OUTDO THE MATTER, THE LETTER AIMING AT OUSTING THE SPIRIT.\"--Henri Bergson"],"descriptions":["Drawn in 2010 and never completed or published, Tracy Auch's gothic, grotesque, and fragmentary epic is presented for the first time in this riso-printed ashcan edition. The anxious and darkly comic narrative takes place in an all-male world in which sexual reproduction does not exist and the primary class division in society is between men and children. With the thematic sensibility of Nikolai Gogol's short stories and the suggestive, world-building scope of British roleplaying fantasy art, The Necrophilic Landscape is certain to enthrall and disgust readers who can finally encounter it for the first time."]},{"title":"Time Capsule Maggie Umber","stats":["52 pp","6x6\"","CMYK offset","perfect bound","printed by Print Ninja in China"],"quotes":["\"Time Capsule is almost wordless, with the few passages that contain words functioning more as poetic framing devices or just lush expressions of a human trying to deal with the confusion of existence. Throughout the book there are letters and numbers rendered as drawings that become decorative design elements on the page, and though they occasionally remind me of where we came from, they also make me think of code, as if in Umber's words, she is seeking an 'innate algorithm [that] breaks down the world hungrily.' It's this revolving door of collecting and processing with no ultimate sense to come from the endeavor that I find both mysterious and compelling.\"--The Comics Journal","\"Maggie Umber's intimate drawings evoke a sense that life on earth, no matter how microscopic, can be immensely beautiful and complex.\"--Jason Murphy","\"Snapshots of moments that would be filler in a nature documentary but that, when collected and cataloged together, delve into the intimacy of those moments and the complexity of animalistic relationships we can never fully understand.\"--Shawn Starr, critic\r\nTime Capsule made Rob Kirby's Rob's Top 30 Comics and Comics-related Things of 2015\r\nTime Capsule is a cache of sketchbook drawings, animals, and insects. Letterforms are treated with a casual randomness, punctuating a non-linear narrative. This is a book of beautiful, ambiguous visual poetry and questions."]},{"title":"Vanishing Perspective Alexis Beauclair","stats":["124 pp","7.5x10.5\"","b&w, CMYK offset","smyth-sewn","dust-jacket","printed by MCRL in China"],"quotes":["\"Where did this man come from? [...] lines so delicate they're like hairs that have dropped onto a scanner from above. Who knew making a series of pictures in navy triangles and circles could be so beautiful?\"--It's Nice That","\"We often expect comics to tell us the stories of adventures. Alexis Beauclair does precisely this and nothing else, but his work extends, synthesizes, crystallizes, refines and intensifies this tradition. 'Action' is the watchword of his narratives, which follow the path of looking and the stages of perception to reconstitute the movement of an intelligence. Alexis Beauclair's comics tell us the story of the adventure of drawing. And (almost) nothing else.\"--Laurent Bruel, Editions Matière","\"Alexis Beauclair's minimalism makes generous play of the act of reading comics. Recalling the lively abstract animation of Viking Eggeling, Oskar Fischinger, and Al Jarnow, Beauclair's formalism is intellectual but never academic. His precise, linear images reveal themselves to be shaded with humor and humanity in their juxtaposition and arrangement.\"--Bill Kartalopoulos, Series Editor for the #1 New York Times best selling Best American Comics series"],"descriptions":["The Sol LeWitt of comics delivers sublime beauty of abstract art as never before in a graphic novel.","Nothing stretches or bends, there is no movement, no animation, no life in static images. But by looking at these pared-down and simple pictures in sequence, you catch glimpses that would indicate otherwise--and that indication is magical. Before your eyes, these abstract simple lines, geometric shapes, and grids come to life. Vanishing Perspective is a comic book in which the reader is light itself.","Includes Kim Jooha interview + Bill Kartalopoulos essay.","Alexis Beauclair lives in France. His acclaimed illustrations and comics have been featured in the New York Times, Pitchfork Review, and Real Life."]},{"title":"Virus Tropical Powerpaola","stats":["160 pp","6 3\/8x8 5\/8\"","2,3 color offset","smyth-sewn ","flexibound","printed by TWP in S. Korea"],"quotes":["\"Through her dense drawings, Powerpaola is able to show us the magic in the mundane.\"--Inés Estrada, author of Alienation","\"Powerpaola has a gift for expressing an entire world with a thin black line, building up textures and details that are a joy to get lost in. In Virus Tropical, her memories of a unique family life are so vividly portrayed that you feel like you are living through all the laughter, joy, tears and door-slamming right along with her. It's a treat of a book.\"--Sarah Glidden, author of Rolling Blackouts","\"Rich experimental visual storytelling.\"--Bomb","\"A frayed patchwork of tension and love.\"--Publishers Weekly","\"Both true and surreal, unmistakably personal in their distorted contours, but universal in their insights about sisterhood and adolescence.\"--The Globe and Mail"],"descriptions":["In Virus Tropical, Powerpaola uses a series of vignettes to transform the simplicity of middle-class family life into a thought-provoking narrative that would have been inconceivable prior to Colombia's sexual revolution. Focusing on the lives of a family of women in the 80's-90's, Powerpaola's tale highlights the excitement, danger, and struggles of a country in the midst of radical change."]},{"title":"Well Come Erik Nebel","stats":["100 pp","5.5x8.5\" ","CMYK offset ","perfect bound","printed by Print Ninja in China"],"quotes":["\"Truly strange. It's like stills from an unrealized, slightly scary kid's show.\"--Alex Schubert, creator of Blobby Boys and Vice contributor \r\n\"'Characters' are identified; 'plot' is ascertained; 'actions' are linked, 'consequences' experienced; and emotions--true emotions--felt. [...] There is something satisfyingly jazz-like in Nebel's effort.\"--The Comics Journal"],"descriptions":["A window into a surreal, spiritual world that twists and turns unexpectedly from one emotion to another. Well Come emotes with bright color and pathos.","Erik Nebel is a non-binary Speech-Language Pathologist, who works with students that are non-verbal and students with Autism and students who are Emotionally Disturbed. Part of their therapy with these students involves drawing pictures as a way to communicate, instead of using words. Well Come, originally published by Yeti Press, is in part, a result of these drawings."]},{"title":"Yours Margot Ferrick","stats":["140 pp","6.4x8.4\"","CMYK offset","smyth-sewn","red gilded edges","printed by TWP in S. Korea"],"quotes":["\"Margot Ferrick makes reading a true act of synesthesia. I hear their colors, and feel rhythms in the repetition of their words and how they draw their letters. They are breaking down the boundaries of what we consider a 'comic book', turning words into pictures and pictures into punctuation. It's not just formalism--Yours has a visual poetry all it's own, expressing on behalf of the protagonist, a desire and longing that goes right to my heart.\"--Lauren Weinstein, author of Being an Artist and a Mother, and \r\nGoddess of War","\"There is so much love in Margot's lines. Their art is so brave! I have never seen drawing like this before.\"--Anna Haifisch, author of The Artist","\"Their spare, crushingly meaningful choice of text is similar to the words left behind on the back of a photograph.\"--The Comics Journal"],"descriptions":["With Yours, the notions of art, poetry, and form collapse into one of the most singular approaches to comics in recent memory. Ferrick's intimate love letters read as both a confession and a seduction.","Margot Ferrick's work has appeared in numerous anthologies, as small-run editions with presses such as Sonatina and Perfectly Acceptable, and in galleries in Baltimore, Virginia, Chicago, Scotland, and San Francisco."]}]